# 5)შექმენით ფუნქცია რომელსაც გადაეცემა სია,ამ სიაში მოთავსებული უნდა იყოს სხვადასხვა მონაცემთა ტიპები,შენი დავალებაა გაიგო თუ ამ სიაში იმყოფება სტრინგი,მაშინ ეს სტრინგი ჩაამატე ახალ სიაში,შემდეგ ეს სია სადაც შენახული გექნებათ სტრინგები გადმოიყვანოთ ერთ მთლიან სტრინგად და თითოეული ელემენტი ერთმანეთისგან დაშორებული იყოს # ნიშნით,შემდეგ დაითვალეთ,თუ რამდენი # ეს ნიშანი გვხვდება ამმსტრინგში


def string_in_list(listt):
    New_list = []
    for char in listt:
        if type(char) == str:
            New_list.append(char)
    
    amount = 0
    New_string = "#".join(New_list)
    for j in New_string: 
        if j == "#":
            amount += 1
            
    return amount
    
print(string_in_list([12, 23, "Nika", 7.8, "Nice", "Friend", True, False]))