# 6)შექმენით ფუნქცია რომელსაც გადასცემთ რიცხვებით სავსე სიას,თქვენი დავალებაა შეამოწმოთ თუ ამ სიაში მყოფი რიცხვების საშუალო არითმეტიკული მეტია 20ზე მაგ შემთხვევაში  0 დან მიღებული საშუალო არითმეტიკულამდე დაატრიალეთ ფორ ციკლი,შენი დავალებაა გაიგო ამ დიაპაზონში ლუწი რიცხვების რაოდენობა და კენტი რიცხვების ჯამი,სხვა შემთხვევაში,დაითვალე 0 დან საშუალო მიღებულ საშუვალო არითმეტიკულამდე და გამოიტანო თითეული რიცხვი


def change_list(listt):
    sum = 0
    amount = 0
    for i in listt:
        sum += i
        amount += 1
    average = sum / amount

    amount2 = 0
    sum2 = 0
    if average > 20:
        for i in range(0, int(average)):
            if i % 2 == 0:
                amount2 += 1
            else:
                sum2 += i
        print(amount2, sum2)
    
    
    else:
        for j in range(0, int(average)):
            print(j)

    return 

(change_list([1, 2, 3, 4, 5, 6, 7, 8, 9, 10]))




