# 1)კომენტარის სახით ჩამოწერეთ ყველა LIST FUNCTION თან ახსენით რას აკეთებს და თითეულის ქვეშ მოიყვანეთ სათითაო მაგალითები

# append() 

# append() ფუნქცია ამატებს ახალ ელემენტს სიის ბოლოში. მაგალითად:

listt1 = [3, 6, 9]
listt1.append(10)
print(listt1)


# insert()

# insert() ფუნქცია საშუალებას გვაძლევს დავამატოთ ელემენტი სიაში კონკრეტულ ინდექსზე ჩვენი სურვილის მიხედვით. მაგალითად:

listt2 = [12, 13, 14]
listt2.insert(2, 15)
print(listt2)


# remove()

# remove() ფუნქცია სიიდან ამოჭრის იმ ელემენტს რომელსაც ჩვენ მივუთითებთ, ან თუ ეს ელემენტი სიაში მეორდება, მაშინ remove() ფუნქცია ამოჭრის პირველ შემთხვევას როდესაც მას სიაში ეს ელემენტი შეხვდება. მაგალითად:

listt3 = [4, 5, 6, 7, 8, 9, 0, 7, 8, 0]
listt3.remove(0)
print(listt3)


# pop()

# pop() ფუნქცია ამოჭრის კონკრეტულ ინდექსზე მდგომ ელემენტს სიიდან. მაგალითად:

listt4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
listt4.pop(5)
print(listt4)


# index()

# index() ფუნქციას ჩვენ გადავცემთ კონკრეტულ ელემენტს, და index() ფუნქცია პოულობს სიაში იმ ინდექსს რომელზეც ჩვენი ელემენტი დგას. თუ ელემენტი სიაში მეორდება, მაშინ index() ფუნქცია დაგვიბრუნებს პირველ ინდექსს სადაც ელემენტი პირველად დგას. მაგალითად:

listt5 = [0, 1, 2, 3, 4, 5]
print(listt5.index(5))


# extend()

# extend() ფუნქცია ორ სიას აერთიანებს, და მათ ყველა ელემენტს. მაგალითად:

listt6 = [0, 1, 2, 3, 4, 5]
listt7 = [6, 7, 8, 9, 10]
listt6.extend(listt7)
print(listt6)


# join()

# join() ფუნქცია აერთიანებს სიის ელემენტებს და გადააქცევს მას სტრინგად. მაგალითად:

listt8 = ["2", "+", "2", "=", "4", "is", "an", "objective", "universal", "truth"]
listt9 = " ".join(listt8)
print(listt9)


# split()

# split() ფუნქცია შლის სტრინგის სიმბოლოს, თუ არ მივუთითებთ რა წაშალოს, მაშინ წაშლის " "-ას, და გადააქცევს სტრინგს სიად. მაგალითი:

listt10 = ["Orthodox theology is beautiful"]
sentence = listt10[0].split()
print(sentence)








