# 2) კომენტარის სახით ახსენით რას ნიშნავს ქეის სენსიტიური, string, float, boolean, integer, list.


# 1. ქეის სენსიტიური

# Python-ი არის ქეის-სენსიტიური პროგრამული ენა, რაც ნიშნავს, რომ ყოველი ასოს სიდიდეს გააჩნია დიდი მნიშვნელობა და ცვლის კოდს, ანუ Python-ში name, Name, NaMe და NAME 4 სხვადასხვა ცვლადია, იგივე ხდება ფუნქციების შემთხვევაშიც, მაგალითად: print() ფუნქცია არ იმუშავებს იმ შემთხვევაში თუ ჩვენ დავწერთ მას პირველი დიდი ასოთი - Print() გამოიტანს შეცდომას ტერმინალში (error).


# 2. string

# string არის ტექსტური ტიპის მონაცემი, რაც ნიშნავს რომ Python-ი მას აღიქვამს ტექსტად, მაგრამ იგი არაა სავალდებულო იყოს ნამდვილი ალფაბეტური ტექსტი იმისათვის რომ Python-მა იგი ტექსტურ ტიპად - string-ად აღიქვას, მთავარია ჩვენი დაწერილი კოდი იყოს ჩასმული ერთ ან ორ-თავიან ბრჭყალებში, ეს საკმარისია რომ Python-მა ჩვენი შეყვანილი კოდი string ტიპად ჩათვალოს. მაგალითად: "მე მქვია ნიკა" და "3" ორივე string ტექსტური ტიპია Python-ში.


# 3. float მონაცემთა ტიპი Python-ში არის ნებისმიერი ათწილადი რომელიც არ წერია ბრჭყალებში - ანუ ნებისმიერი ათწილადი რომელიც არ არის სტრინგი. იგი შეიძლება იყოს დადებითი და უარყოფითი რიცხვიც, მთავარია რომ იგი იყოს ათწილადი. მაგალითად:
# 3.5; 0.0001: 999.99999 და -1456.3348374384, ოთხივე არის float მონაცემთა ტიპი.


# 4. boolean 

# boolean არის ლოგიკური ტიპის მონაცემი და მას გააჩნია მხოლოდ 2 შესაძლო მნიშვნელობა: True და False. ჩვენ True და False ლოგიკური ტიპის მონაცემები შეგვიძლია მივიღოთ ლოგიკური ოპერატორებიდან და შედარების ოპერატორებიდან. მაგალითად: 56786565656656 > 1 დაბეჭდავს True, 18 > 19 დაბეჭდავს False.



# 5. integer

# integer მონაცემთა ტიპი Python-ში არის ნებისმიერი მთელი რიცხვი რომელიც არ წერია ბრჭყალებში - ანუ ნებისმიერი მთელი რიცხვი რომელიც არ არის სტრინგი. იგი შეიძლება იყოს დადებითი და უარყოფითი რიცხვიც, მთავარია რომ იგი იყოს მთელი რიცხვი. მაგალითად:
# 156; 100000000: 99999999 და -45475854857, ოთხივე არის integer მონაცემთა ტიპი.


# 6. list 

# list არის მონაცემთა ტიპი Python-ში, რომელიც საშუალებას გვაძლევს შევინახოთ ბევრი სხვადასხვა ან ერთნაირი ტიპის ელემენტები 1 სიაში და ამით 1 ცვლადში. სია (list) იქმნება ოთკუთხედი ფრჩხილებით [] და შეიძლება შეიცავდეს უამრავი განსხვავებული მონაცემთა ტიპის ელემენტებს. მაგალითად: string_lists = ["Nika", "Goga", "Zura"] mixed_list = ["Nika", 345, 56.34, True] აქედან ოთხივე არის ლისტი.

