# 1)შექმენით ფუნქცია რომელსაც გადაეცემა სია სადაც მოთავსებული იქნება მხოლოდ რიცხვები და სტრინგ ტიპის მონაცეემები,თქვენი დავალებაა რომ ამ სიიდან ამოიღოთ ინტეჯერ ტიპის მონაცემეები და დაამატოთ ახალ სიაში,და ასევე უნდა ამოიღო სიიდან სტრინგ ტიპის მონაცემები და დაამატო ესეც სხვა ახალ სიაში,თქვენი დავალებაა რომ რიცხვებით სავსე სია დაალაგოთ ზრდადიბის მიხედვით და სტრრინგების სია დაალაგოთ სიაში მოთავსებული სიტყვების სიგრძის მიხედვით


def change_list(listt):
    New_list1 = []
    New_list2 = []
    for i in listt:
        if type(i) == int:
            New_list1.append(i)
        else:
            New_list2.append(i)

    New_list3 = sorted(New_list1)
    New_list4 = sorted(New_list2, key=len)

    return New_list3, New_list4

print(change_list([1, 2, 3, 4, 5, "Nika", "Goga", "Rati", "Andria"]))
