# 1) ჩამოწერეთ and / or - ზე ყველა შესაძლო ვარიანტი და გვერდზე კომენტარის სახით მიუწერეთ რას გამოიტანს შედეგად.


# ლოგიკური ოპერაციები შეყვანის სახით რამდენიმე Boolean მნიშვნელობას იღებს, და გამოიმუშავებს ერთ Boolean მნიშვნელობას. „და“ და „ან“ ლოგიკური ოპერაციების მაგალითებია:

print(True and True) 
print(5 > 3 or 5 > 4) # როცა ვიყენებთ "და" ლოგიკურ ოპერატორს, თუ ორივე მნიშვნელობა არის სიმართლე, მაშინ კოდი გამოიტანს სიმართლეს, ყველა სხვა შემთხვევაში კოდი გამოიტანს სიცრუეს, მაგალითად:

print(True and False)
print(10 < 11 and 11 < 10) 
print(False and True)
print(1 > 100 and 100 > 1)
print(False and False)
print(25 > 567 and 35 > 675) # ყოველ ამ შემთხვევაში, ჩვენ მივიღებთ სიცრუეს (False).


#რაც შეეხება "ან" (or) ლოგიკურ ოპერატორს, მისი ეფექტი არის საპირისპირო - თუ გვაქვს მოცემული ორი სიცრუე, მივიებთ სიცრუეს, ყველა სხვა შემთხვევაში სადაც ერთ-ერთი მოცემული Boolean მნიშვნელობა მაინც არის სიმართლე, ჩვენ მივიღებთ სიმართლეს:

print(False or False)
print(11 > 99 or 99 > 100) # დაპრინტავს სიცრუეს

print(True or False)
print(84 > 48 or 84 < 48)
print(False or True)
print(2 < 1 or 7 > 1)
print(True or True)
print(5 > 4 or 6 > 5) # სამივე დაპრინტავს სიმართლეს






