# 2) კომენტარის სახით ჩამოწერეთ and / or ოპერატორები რას ანიჭებენ უპირატესობას. მაგალითებიც მოიფიქრეთ. 

# აქ საუბარი არის ლოგიკურ ოპერატორებს შორის პრიორიტეტზე. როცა and და or ერთდროულად გამოიყენება,რომელი უფრო მალე შესრულდება Python-ში? Python-ში and ოპერატორს აქვს უფრო მაღალი პრიორიტეტი, ვიდრე or ოპერატორს. ეს ნიშნავს რომ ჯერ შესრულდება and ოპერატორის კოდი და შემდეგ or ოპერატორის თანმიმდევრობის მიუხედავად. მაგალითად:

print(True or False and False) # კოდის მიერ შეფასება ხდება ასე - True or (False and False), ანუ ჯერ გამოითველბა False and False რაც არის False, და შემდეგ ამ False-თან გამოითვლება True or False, და პასუხად მივიღებთ True.

# მაგალითი 2:

print(False or True and False) # კოდის მიერ შეფასება ხდება ასე - False or (True and False), ანუ კოდი ჯერ დაითვლის True and False-ს, რაც არის False, და შემდეგ ამ False-თან გაკეთდება False or False, და პასუხად მივიღებთ False.
