# 7)კომენტარის სახით აღწერეთ ყვეელაფერი ფუნქციის შესახებ,რატომ ვიყენებთ და რატომ არის კარგი მისი გამოყენება რაში გვეხმარება და ასე შემდეგ,ასვევე დაწერეთ როგორ ვქმნით მას და რა მნიშვნელობები გადაეცემა მას


# ფუნქციის გამოყენების მიზანი: ფუნქცია არის კოდის ფრაგმენტი, რომელსაც აქვს სახელი და ასრულებს კონკრეტულ ამოცანას. მისი მთავარი მიზანია კოდის გამეორების თავიდან აცილება, კოდის სტრუქტურის ლამაზად დაწყობა და კოდის უკეთ კითხვადობა. ამით ჩვენ ვზოგავთ დროს, და იგი ასევე ამცირებს შეცდომების დაშვების ალბათობას, რადგან ერთხელ დაწერილი ერთი და იგივე კოდი იგივე ლოგიკის გამოყენებით შეგვიძლია ბევრჯერ გამოვიძახოთ. 

# როგორ მუშაობს ფუნქცია: ფუნქცია იწყება def საკვანძო სიტყვით (keyword), შემდეგ ვუწერთ ფუნქციის სახელს და თუ სავალდებულოა, მაშინ ფრჩხილებში ვწერთ პარამეტრებს - (შეიძლება არც იყოს პარამეტრების დაწერა კონკრეტულ შემთხვევაში საჭირო), ბოლოს ფუნქციის სხეულში ვწერთ თუ რას აკეთებს ჩვენი კოდი.

# ფუნქცია შეიძლება აბრუნებდეს: რაიმე კონკრეტულ მნიშვნელობას, (მაგალითად რიცხვს, ტექსტს, სიას), ან საერთოდ არაფერს.

# ფუნქციის შექმნის მაგალითი:

def greet(name):
    # ეს ფუნქცია იღებს 1 პარამეტრს სახელად name
    # და ბეჭდავს მისალმების ტექსტს ეკრანზე
    print("გამარჯობა " + name + "! გამიხარდა შენი ნახვა.")

# ფუნქციის გამოძახება: როცა გვინდა რომ ფუნქციამ დაგვიბეჭდოს კოდი ტერმინალში, ვწერთ მის სახელს და გადავცემთ მონაცემს ან მონაცემებს.

greet("ნიკა") # შედეგი: გამარჯობა ნიკა! მიხარია შენი ნახვა.
