# 10) for loop და range() ფუნქცია ახსენით კომენტარის სახით. ასევე პატარა ნახაზიც გააკეთეთ ლუპზე paint-ში, როგორ წარმოგიდგენიათ. 


# for loop გვეხმარება ერთსა და იმავე კოდის ბევრჯერ შესრულებაში სხვადასხვა მნიშვნელობებით. range() ქმნის რიცხვების მიმდევრობას, რომელზეც for ციკლი გადადის:

for i in (1, 6): # ეს ნიშნავს რომ უნდა დაიწყოს 1-დან, გაგრძელდეს 6-დე, (6 არ შედის), და იმატოს თითოეულ ნაბიჯზე ერთით.
    print(i) # ბეჭდავს მიმდინარე რიცხვს ყოველ იტერაციაზე.


# მაგალითები:
# 1. მარტივი ციკლი:
for i in range(5):
    print(i) # i გადაივლის 0-დან 5-მდე ყველა რიცხვს. ტერმინალში გამოვა: 0, 1, 2, 3, 4 ცალ-ცალკე.


# 2. ციკლი 1-დან 10-მდე:
for i in range(1, 11):
    print(i) # დაიწყება 1-დან, გაგრძელდება 11-მდე, ანუ 10-ის ჩათვლით. ტერმინალში გამოვა: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ცალ-ცალკე.


# 3. ყოველ მეორე რიცხვზე გადასვლა:
for i in range(1, 11, 2):
    print(i) # დაიწყება 1-დან, გაგრძელდება 11-მდე, 2-ის გამოტოვებით. ტერმინალში გამოვა: 1, 3, 5, 7, 9 ცალ-ცალკე.

# 4. კლებადი მიმდევრობა: 
for i in range(10, 0, -1):
    print(i) # დაიწყება 10-დან, (10-ის ჩათვლით), გაგრძელდება 0-მდე, (1-ის ჩათვლით), -1-ის გამოტოვებით. ტერმინალში გამოვა: 10, 9, 8, 7, 6, 5, 4, 3, 2, 1 ცალ-ცალკე.