#8)ჩამოწერეთ სიის ფუნქციები,ახსენით ისინი და მოიყვანეთ მაგალითები


# 1.append() ამატებს რაიმეს: სტრინგს, ინტიჯერს და ასე შემდეგ, სიის ბოლო ინდექსზე. მაგალითი:

listt = [1, 2, 3, 4]
listt.append(5)
print(listt)

# 2. insert() ამატებს რაიმეს: სტრინგს, ინტიჯერს, იმ ინდექსზე სიაში რომელ ინდექსსაც დავუწერთ. ჯერ ვუწერთ ინდექსს და შემდეგ რისი ჩამატებაც გვინდა იმას. მაგალითი:

listt2 = [1, 2, 3, 4]
listt2.insert(2, 5)
print(listt2)

# 3. pop() შლის სიიდან იმ ინდექსზე მდგომ ელემენტს რომელ ინდექსსაც მივუთითებთ. მაგალითი:

listt3 = [1, 2, 3, 4]
listt3.pop(3)
print(listt3)

# 4. remove() შლის სიიდან იმ ელემენტს რომელსაც ჩვენ მივუთითებთ. მაგალითი: 

listt4 = [1, 2, 3, 4]
listt4.remove(3)
print(listt4)

# 5. extend() 2 ან მეტ სიას ამატებს ერთმანეთს და ახალ შეჯგუფებულ სიას არქმევს პირველი სიის სახელს რომელიც დავამატეთ. მაგალითად:

listt5 = [1, 2, 3, 4]
listt6 = [5, 6, 7, 8]
listt5.extend(listt6)
print(listt5)

