# 13)შექმენი სია სადაც მოთავსებ ელემენტებს,შენი დავალებაა ამ სსიიდან ამოშალო მესამე ინდექსზე მდგომი ელემენტი,ამ სიაშ ჩაამატე სახელი "ირაკლი" , ასევე გაიგე მეხუთე  რომელიმე ელემენტის ინდექსი(შესაბამისი ფუნქციის დახმარებით) , ასევე გაიგე ამ სიის სიგრძე , და ბოლოს სიიდან ამოშალე რომელიმე ელემენტი (შესაბამისი ფუნქციის დახმარებით(სახელის მიხედვით))


listt = ["Nika", "Dato", "Ana", "Kato", "Kaxi", "Merabi", "Andria"]
print(listt.pop(3))
print(listt.append("Irakli"))
print(listt.index(5))
print(len(listt))
print(listt.remove("Andria"))



