# 3)კომენტარის სახით ახსენით რა არის კონკატინაცია და მოიყვანეთ მაგალითები

# კონკატინაცია ნიშნავს სტრინგების შეერთებას. Python-ში ამისთვის ვიყენებთ + სიმბოლოს. მაგალითად:

saxeli = "ნიკა"
misalmeba = "გამარჯობა, " + saxeli
print(misalmeba)  # შედეგი: გამარჯობა, ნიკა


# ასევე შეგვიძლია რამდენიმე სტრინგის გვერდიგვერდ დაწერითაც გავაკეთოთ კონკატინაცია:
გაგიმარჯოს = "მოგესალმები " "ჩემს პროგრამაში!"
print(გაგიმარჯოს)  # შედეგი: მოგესალმები ჩემს პროგრამაში!


# თუ გვინდა სტრინგს დავუმატოთ რიცხვი, ეს რიცხვი უნდა გარდავქმნათ სტრინგად:
asaki = 19
print("ჩემი ასაკია " + str(asaki))  # შედეგი: ჩემი ასაკია 19
