# 4)შექმენით ცვლადები სადაც შეინახავთ სახელს გვარს ასაკს სიმაღლეს და საცხოვრებელ ადგილს,თქვენი დავალება იქნება გამოიტანოთ ეს ყველაფერი ერთ გრძელ წინადადებად გამოიყენეთ ნასწავლი მასალა int() str()...
#  და კონკატენაცია


სახელი = "ნიკოლოზ"
გვარი = "წერეთელი"
ასაკი = "19"
სიმაღლე = "1.82"
საცხოვრებელი_ადგილი = "თბილისში, პეკინის ქუჩაზე."

print("გამარჯობა, მე მქვია " + სახელი + " " + გვარი + ", მე ვარ " + str(ასაკი) + " წლის, და მთლად ძალიან თუ გაინტერესებს დეტალები, გეტყვი რომ " + სიმაღლე + " მეტრი ვარ სიმაღლეში, და ვცხოვრობ " + საცხოვრებელი_ადგილი)
      
