# 5)მომხმარებელს შემოატანინეთ ავტომობილის სახელი,ავტომობილის ფერი,ავტომობილის ფასი და ასევე შემოატანინეთ ავტომობილის გამოშვების თარიღი და შენინახეთ ეს ყველაფერი ცვლადებში,input ებთან როგორც გასწავლეთ თ რიცხვი შემოაქვს მომხმარებელს გადააქციეთ ეს input ები ინტეჯერებად და ამის შემდეგ მოახდინეთ ამ ყველაფრის კონკატენაცია ანუ გამოიტანეთ მომხმარებლის მიერ შემოყვანილი მნიშვნელობები ერთ გრძელ წინადადებად


ავტომობილის_სახელი = input("შეიყვანე ავტომობილის სახელი!: ")
ავტომობილის_ფერი = input("შეიყვანე ავტომობილის ფერი!: ")
ავტომობილის_ფასი = int(input("შეიყვანე ავტომობილის ფასი!: "))
ავტომობილის_გამოშვების_თარიღი = int(input("შეიყვანე ავტომობილის გამოშვების თარიღი!: "))
print("ეს არის თქვენი მოთხოვნის შესაბამისი " + ავტომობილის_ფერი + " " + ავტომობილის_სახელი + ", იგი არის " + str(ავტომობილის_გამოშვების_თარიღი) + " წლის ვერსია, ჩემი აზრით ძალიან მოგეწონებათ, მისი ფასი არის სულ რაღაც " + str(ავტომობილის_ფასი) + " დოლარი!")
