# 8)შექმენით ცვლადი ამ ცვლადში შეინახეთ მნიშვნელობად ინტეჯერი და შემდეგ გადააქციეთ ეს ინტეჯერი სტრინგად(გამოიყენეთ შესაბამისი ფუნქცია,ბრჭყალებში არ ჩასვათ😁😆),ამის შემდეგ შექმენით მეორე ცვლადი და მნიშვნელობად მიანიჭეთ რაიმე რიცხვი ოღნდ ეს რიცხვი იყოს სტრინგი,თქვენი მოვალეობაა გადააქციოთ ეს სტრინგი რიცხვი ინტეჯერად(აქაც გამოიყენეთ შესაბამისი ფუნქცია


My_future_Wife_Age = 649687
STRIINGG = str(My_future_Wife_Age)
print(STRIINGG)

The_String_Age_Of_My_Future_Wife = "649687"
print(int(The_String_Age_Of_My_Future_Wife))