# 1) კომენტარის სახით ახწერეთ თითოეული მონაცემთა ტიპის მნიშვნელობა და მოიყვანეთ მაგალითები


# 1. int (მთელი რიცხვი)

# გამოიყენება მთელი რიცხვების ცვლადებში შესანახად და მათემატიკური ოპერაციებისთვის:

age = 19
year = 2025
temperature = -5

# 2. float (ათწილადი რიცხვი)

# გამოხატავს ათწილად რიცხვებს, ასევე ვიყენებთ მათემატიკურ ოპერაციებში:

pi = 3.14
height = 1.82
balance = -25.6

# 3. str (სტრინგი, ანუ ტექსტი)

# გამოიყენება ტექსტური მონაცემებისთვის - ყველაფერი რაც ბრჭყალებში იწერება:

name = "Nika"
message = "Hello world!"
char = "A"
number = "7"

# 4. bool (ლოგიკური ტიპი)

# გააჩნია მხოლოდ 2 მნიშვნელობა: True და False:

Is_adult = True
Is_raining = False

# 5. list (სია)

# ელემენტების მიმდევრობა, სადაც შეგვიძლია სხვადასხვა ტიპის მონაცემების შენახვა:

fruits = ["apple", "banana", "orange"]
numbers = [1, 2, 3, 4, 5]
mixed = [1, "text", True]









