# 9) კომენტარის სახით ახსენით რა განსხვავებაა for loop და while loop-ს შორის.


# for ციკლი - გამოიყენება მაშინ როდესაც ვიცით თუ რამდენჯერ უნდა შესრულდეს ციკლი, ან როდესაც სიაში, - list, string, და ასე შემდეგ - გვინდა რომ გადავიაროთ ელემენტებზე.

# სტრუქტურა:

for ცვლადი in მიმდევრობა:
    კოდი_ციკლის_შიგნით

# მაგალითი რიცხვებისთვის:

for i in range(5):
    print(i)

# აქ for ციკლი იმუშავებს 0-დან 4-მდე (ჯამში 5-ჯერ).

# მაგალითი სიაზე:

for ხილი in ["ვაშლი", "მსხალი", "ატამი"]:
    print(ხილი)


# while ციკლი - გამოიყენება მაშინ, როდესაც არ ვიცით ზუსტად რამდენჯერ უნდა შესრულდეს ციკლი, ანუ ციკლი გაგრძელდება მანამ, სანამ გარკვეული პირობა სიმართლეა (True).

# სტრუქტურა:

while პირობა:
    კოდი_ციკლის_შიგნით

# მაგალითი რიცხვებისთვის:

x = 0
while x > 5:
    print(x)
    x += 1    # ამ შემთხვევაში კოდი იმუშავებს მანამ, სანამ x < 5

# მაგალითი სტრინგისთვის:

Name = input("Enter your name here: ")
while len(Name) >= 14:
    print("A long name you got there my friend!")

# while ციკლს ასევე შეუძლია გააგრძელოს ერთი და იგივე მოქმედების შესრულება უსასრულოდ, თუ მისთვის მიცემული პირობა იქნება ყოველთვის ჭეშმარიტი. მაგალითად:

while True:
    print("Coding is fun!")

# ან ასე:

Name = input("Enter your name here: ")
Age = int(input("Enter your age here: "))
while 5 > 3: 
    print("My name is " + Name + " and I am " + str(Age) + " years old.")


    















