# 5)შექმენი ფუნქცია სადაც იქნება მოთავსებული რენდომ ტიპის ელემენტები,თქვენი დავალებაა ამოშალოთ ამ სიიდან ბოლო ინდექსზე მდგომი ელემენტი,ჩაამატო ამ სიაში რიცხვი 20 ბოლო ინდექსზე, ამოშალო სიიდან რომელიმე სტრინგ ტიპის მონაცემი,ჩაამატო ამ სიაშ მე 4 ინდექსზე სტრინგი"atami" ,გამოიყენე შესაბამისი სიის ფუნქციები


def change_list(listt):
    listt.pop(-1)
    listt.append(20)
    listt.remove("Vaxo")
    listt.insert(4, "atami")
    return listt

print(change_list([1, 2, 3, 4, 5, 6, "Vaxo", "Ana", "Kato"]))