# 1)შექმენით სია სადაც მოთავსებული გექნებათ სახელები,თქვენი დავალებაა სიის ბოლოში დაამატოთ "ფორთოხალი",მოიყვანე კიდევ ორი მაგალითი სადაც დაამატებ სხვა ელემენტებს სიაში


Names = ["ნიკა", "გოგი", "ნანული", "მედეა", "მაია", "კესო", "რატი", "ელენე", "ვახტანგი"]
Names.append("ფორთოხალი")
print(Names)


Surenames = ["წერეთელი", "ჭავჭავაძე", "გოგებაშვილი", "ბაგრატიონი", "მეტრეველი", "ტაბიძე"]
Surenames.append("მგალობლიშვილი")
print(Surenames)


Lessons = ["ინჟინერული მათემატიკა 2", "დისკრეტული მათემატიკის ელემენტები", "ინგლისური ენა-3", "ფიზიკა 2", "კომპიუტერის არქიტექტურის და ორგანიზაციის საფუძვლები (INF)", "მონაცემთა სტრუქტურები და ალგორითმები"] 
Lessons.append("სოციოლოგია")
print(Lessons)