# 1) კომენტარის სახით ჩამოწერეთ რა არის string, float, integer, boolean ტიპები, რაც იცით ყველაფერი. და მაგალითებიც მოიყვანეთ


# String არის ტექსტი, რომელიც ბრჭყალებში იწერება. მაგალითად:
სახელი = "ნიკა"   
ქვეყანა = 'საქართველო'  
# არ აქვს მნიშვნელობა ერთ ბრჭყალებში ჩავსვამთ თუ ორში, შედეგი იგივეა.
# String-ები შეიძლება იყოს ცარიელიც:
ცარიელი_ტექსტი = ""

# String-ით შეგვიძლია ერთმანეთს დავამატოთ ტექსტები:
სრული_სახელი = "ნიკოლოზ" + " " + "წერეთელი"  # შედეგი: "ნიკოლოზ წერეთელი"


# Integer არის მთელი რიცხვი:
ასაკი = 19     
წელი = 2025   

# Integer-ები შეგვიძლია შევინახოთ ცვლადში როგორც მათემატიკური მოქმედებები:
ჯამი = 10 + 15    
განსხვავება = 100 - 40  


# Float არის ათწილადი:
სიგრძე = 1.75   
ფასი = 9.99     

# Float-ითაც შეგვიძლია შევადგინოთ მათემატიკური მოქმედებები:
ჯამი = 3.5 + 2.25  


# Boolean არის ლოგიკური ტიპი: True ან False
არის_სიცხე = True     
არის_წვიმა = False    

# Boolean ხშირად გამოიყენება პირობებში:
if ასაკი > 18:
    დადის_უნივერსიტეტში = True
else:
    დადის_უნივერსიტეტში = False