# 2) კომენტარის სახით დაწერეთ ცვლადს როგორი სახელები არ შეიძლება რომ ერქვას.  და როგორი სახელები ჯობია რომ ერქვას. აქვე დაწერეთ რა განსხვავებაა = და == შორის. 


# ცლვადს არ შეიძლება ერქვას სახელი რომელიც იწყება რაიმე ციფრით, მაგალითად:
12მაისი = "ანდრია პირველწოდებულის ხსენების დღე"

# ცვლადის სახელი უნდა იწყებოდეს ან ასოთი, ან ქვედა ტირეთი, მაგალითად: 
გაბრიელი = "კაცი"
_ჭადრაკი = "სტრატეგიული თამაში"

# მაგრამ არ შეიძლება რომ ცვლადი იწყებოდეს ნებისმიერი რაიმე სხვა ნიშნით, მაგალითად: 
?კითხვა = "გაურკვევლობა"  # არის არასწორი ცვლადის სახელი

# ცვლადის სახელები არიან ქეის-სენსიტიურები:
age = 6
Age = 7
AGE = 8  # სამივე არის ერთმანეთისგან განსხვავებული ცვლადები

# თუ ცვლადის სახელში არის 2 ან მეტი სიტყვა, ჩვენ არ შეგვიძლია ისინი დავწეროთ ცალცალკე: 
მე და შენ = "მეგობრები"  # არის არასწორი ცვლადის სახელი

# ყველაზე ხშირად გამოყენებადი მეთოდი ასეთ შემთხვევაში, არის snake-case მეთოდი, რომლის მიხედვითაც, ჩვენ ყოველ სიტყვას შორის ვწერთ ქვედა ხაზს:
მე_და_შენ = "მეგობრები"  # ეს არის სწორი სახელი ცვლადისთვის


# = არის მინიჭების ოპერატორი, ანუ ერთნიშნა ტოლობის გამოყენებით, ჩვენ ვანიჭებთ ცვლადს რაიმე მნიშვნელობას, მაგალითად:
მე = "ქრისტიანი"

# ხოლო ორნიშნა ტოლობა == არის შედარების ოპერატორი, ლოგიკური ოპერატორი, რომელიც ადარებს ორ ობიექტს და გამოიყენება როგორც მათემატიკურ შედარებაში, ასევე თითქმის ყველა მონაცემის ტიპთან შედარებისთვის. მაგალითად:
x = 5
print(x == 5)   # დაბეჭდავს: True
print(x == 10)  # დაბეჭდავს: False  
# მაგრამ ასევე გვაქვს არა მხოლოდ მათემატიკური გამოყენება, მაგალითად:
სახელი = "ნიკა"
print(სახელი == "ნიკა")      
print(სახელი == "გიორგი") 

სიცხე_არის = True
print(სიცხე_არის == True)     
print(სიცხე_არის == False)

# და ასე შემდეგ
 