# გაასწორეთ კოდი და მიუწერეთ რატომ იყო ძველი ვერსია არასწორი:

#      ----------------
#      num 1 == 10
#      ----------------
#      academy = Goal Oriented Academy
#      ----------------
#      name = 'Jumbera'
#      name2 = 'mayvala'
#      print(name = Name2)
#      ————————
#      num = (“30”)
#      Print(str(num)+20)



# num 1 არის არასწორი ცვლადის სახელი. უნდა იყოს num_1 == 10

# კოდში academy = Goal Oriented Academy - academy ცვლადს გადავცემთ Goal Oriented Academy - რომელიც თვითონაც არის ცვლადი, რომელსაც არ აქვს მიცემული მნიშვნელობა. თუ არ გვაქვს აქამდე Goal Oriented Academy-ის სახელით ცვლადი, მაშინ Goal Oriented Academy უნდა იყოს სტრინგი - academy = "Goal Oriented Academy"

name = 'Jumbera'
name2 = 'mayvala'
print(name = Name2) # ამ კოდში არის რამდენიმე შეცდომა: პირველი შეცდომა არის ის რომ print() ფუნქციაში ჩვენ არ ვიყენებთ ერთნიშნა ტოლობას =, რადგან ეს არის მინიჭების ოპერატორი, და არა შედარების ოპერატორი, რომელიც არის ==. ასევე, Python არის ქეის-სენსიტიური ენა, და name2 და Name2 არის 2 განსხვავებული ცვლადი.

num = (“30”)
Print(str(num)+20) # ამ კოდშიც არის რამდენიმე შეცდომა. პირველ რიგში, ამ კოდში გამოყენებული ბრწყალები “” არ არის Python-ში გამოყენებული ბრჭყალები "", ან '', ამიტომ (“30”)-ს ფრჩხილებიც რომ მოვაცილოთ, “30”-ს Python-ი მაინც არასწორად ჩათვლის. შემდეგი შეცდომა არის სიტყვაში Print, რომელიც პატარა ასოებით უნდა იწერებოდეს რომ print() ფუნქციამ იმუშაოს. ბოლო შეცდომა არის print() ფუნქციაში - (str(num)+20) - აქ ჩვენ სტრინგს ვუმატებთ ინტიჯერს, რაც არის შეცდომა. Python-ში ტექსტს და რიცხვს ვერ მივუმატებთ ერთმანეთს პირდაპირ, რადგან მივიღებთ შეცდომას. ამ კოდის სწორად დაწერა შეიძლებოდა ასე:

num = "30"
print(num + "20")   # შედეგი იქნება: 3020

# ან თუ გვინდა რიცხვების მიმატება print() ფუნქციაში:

num = "30"
print(int(num) + 20)   # შედეგი იქნება: 50


