# 3)შექმენით ცვლადი სადაც შეინახავთ მომხმარებლის შემოყვანილ რიცხვს,თქვენი დავალებაა 1 დან მომხმარებლის შემოტანილი რიცხვის ჩათვლით გამოიტანოთ  ლუწი რიცხვების ჯამი და კენტი რიცხვების რაოდენობა,შემდეგ  გაიგეთ ამ ორი რიცხვის(საბოლოო ჯამის და საბოლოო რაოდენობის) საშუალო არითმეტიკული


num = int(input("Enter a random number here: "))
def average(num):
    sum = 0
    amount = 0
    for i in range(1, num + 1):
        if i % 2 == 0:
            sum += i
        else:
            amount += 1
    
    return sum / amount

print(average(num))