# 4)შექმენით სია სადაც მოთავსებული გექნებათ ყველა მონაცემთა ტიპის ელემენტები და კომენტარის სახით დაწერეთ რომელ ინდქსზე მდებარეობს თითოეული ელემენტი,ეს ინდექსები უნდა იყოს როგორც დადებითი ასევე უარყოფითი


All_data_types = [11, 24.5, "lalalalalala", "FRODOOO!!!", 19 > 18 ]

# Python-ში ინდექსაცია იწყება ყოველთვის ნულიდან, იგივე ხდება სიაში (list) - 11 არის ინტიჯერი (int), მთელი რიცხვი, და დგას მენულე ინდექსზე ჩვენს ლისტში, 24.5 არის ათწილადი (float), და დგას პირველ ინდექსზე ჩვენს სიაში, "lalalalalala" და "FRODOOO!!!" არიან 2 ცალი ტექსტური ტიპის მონაცემები, ანუ სტრინგები (string), და ჩვენს ლისტში იკავებენ მეორე და მესამე ინდექსის ადგილს, ხოლო 19 > 18 არის ლოგიკური მონაცემთა ტიპი (boolean), ის მდებარეობს მეოთხე ინდექსზე.
# მაგრამ ჩვენ სიაში ასევე შეგვიძლია ინდექსაცია შევასრულოთ უკუღმა, ანუ ბოლო ელემენტიდან პირველ ელემენტამდე, და ამ შემთხვევაში ჩვენ ვიყენებთ უარყოფით ინდექსაციას. ამ შემთხვევაში, ბოლო ელემენტი 19 > 18 (True) დგას -1 ინდექსზე, "FRODOOO!!!" -2 ინდექსზე, "lalalalalala" -3 ინდექსზე, 24.5 -4 ინდექსზე, და 11 -5 ინდექსზე.